# GridCount Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FillPattern..::..GridCount Property
FillPattern Class See Also
---
Gets the count of the fill grids in this fill pattern.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int GridCount { get; }
```

Visual Basic
---
```text
Public ReadOnly Property GridCount As Integer
	Get
```

Visual C++
---
```text
public:
property int GridCount {
	int get ();
}
```

# See Also
FillPattern Class
Autodesk.Revit.DB Namespace